Revit 2027 API
ScheduleField.FieldType Property
 The type of data displayed by the field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldType FieldType { get; }
Public ReadOnly Property FieldType As ScheduleFieldType
	Get
public:
property ScheduleFieldType FieldType {
	ScheduleFieldType get ();
}
member FieldType : ScheduleFieldType with get
Property Value
ScheduleFieldType
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace